{"class_name": "Functional", "config": {"name": "JointL2h512Attention_CnnL2h128BN_RnnL1BN_simple", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1001, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "dna"}, "name": "dna", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "dna_conv1d", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [11], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}, "shared_object_id": 3}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dna_conv1d", "inbound_nodes": [[["dna", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dna_batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dna_batch_normalization", "inbound_nodes": [[["dna_conv1d", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dna_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "dna_activation", "inbound_nodes": [[["dna_batch_normalization", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "cpg_state"}, "name": "cpg_state", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "cpg_dist"}, "name": "cpg_dist", "inbound_nodes": []}, {"class_name": "MaxPooling1D", "config": {"name": "dna_max_pooling1d", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "name": "dna_max_pooling1d", "inbound_nodes": [[["dna_activation", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "cpg_lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwApA07p/////6kB2gRh\neGlzKQLaAUvaC2V4cGFuZF9kaW1zqQHaAXSpAHIIAAAA+movaG9tZS9xa2xpdV9wa3VocGMvbHVz\ndHJlMi9taW5pY29uZGEzL2VudnMvZGVlcGNwZ19ncHVfMy9saWIvcHl0aG9uMy45L3NpdGUtcGFj\na2FnZXMvZGVlcGNwZy9tb2RlbHMvY3BnLnB52gg8bGFtYmRhPjIAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "deepcpg.models.cpg", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "cpg_lambda", "inbound_nodes": [[["cpg_state", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "cpg_lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwApA07p/////6kB2gRh\neGlzKQLaAUvaC2V4cGFuZF9kaW1zqQHaAXSpAHIIAAAA+movaG9tZS9xa2xpdV9wa3VocGMvbHVz\ndHJlMi9taW5pY29uZGEzL2VudnMvZGVlcGNwZ19ncHVfMy9saWIvcHl0aG9uMy45L3NpdGUtcGFj\na2FnZXMvZGVlcGNwZy9tb2RlbHMvY3BnLnB52gg8bGFtYmRhPjIAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "deepcpg.models.cpg", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "cpg_lambda_1", "inbound_nodes": [[["cpg_dist", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "dna_conv1d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}, "shared_object_id": 3}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dna_conv1d_1", "inbound_nodes": [[["dna_max_pooling1d", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "cpg_concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "cpg_concatenate", "inbound_nodes": [[["cpg_lambda", 0, 0, {}], ["cpg_lambda_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dna_batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dna_batch_normalization_1", "inbound_nodes": [[["dna_conv1d_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "cpg_lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMMAAAAdACgAXwAiAChAlMAqQFOqQLaAUvaB3Jlc2hh\ncGWpAdoBdKkB2hF0YXJnZXRfc2hhcGVfZmxhdKkA+movaG9tZS9xa2xpdV9wa3VocGMvbHVzdHJl\nMi9taW5pY29uZGEzL2VudnMvZGVlcGNwZ19ncHVfMy9saWIvcHl0aG9uMy45L3NpdGUtcGFja2Fn\nZXMvZGVlcGNwZy9tb2RlbHMvY3BnLnB52gg8bGFtYmRhPqkAAADzAAAAAA==\n", null, [[-1, 50, 2]]], "function_type": "lambda", "module": "deepcpg.models.cpg", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "cpg_lambda_2", "inbound_nodes": [[["cpg_concatenate", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dna_activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "dna_activation_1", "inbound_nodes": [[["dna_batch_normalization_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "cpg_time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "cpg_time_distributed", "inbound_nodes": [[["cpg_lambda_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "dna_max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "dna_max_pooling1d_1", "inbound_nodes": [[["dna_activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "cpg_batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "cpg_batch_normalization_3", "inbound_nodes": [[["cpg_time_distributed", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "dna_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "dna_flatten", "inbound_nodes": [[["dna_max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "cpg_activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "cpg_activation_3", "inbound_nodes": [[["cpg_batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dna_dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dna_dense", "inbound_nodes": [[["dna_flatten", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "cpg_bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 44}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 45}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 46}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}, "shared_object_id": 47}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "cpg_bidirectional", "inbound_nodes": [[["cpg_activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dna_batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dna_batch_normalization_2", "inbound_nodes": [[["dna_dense", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "cpg_lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMMAAAAdACgAXwAiAChAlMAqQFOqQLaAUvaB3Jlc2hh\ncGWpAdoBdKkB2hd0YXJnZXRfc2hhcGVfcmVwbGljYXRlc6kA+movaG9tZS9xa2xpdV9wa3VocGMv\nbHVzdHJlMi9taW5pY29uZGEzL2VudnMvZGVlcGNwZ19ncHVfMy9saWIvcHl0aG9uMy45L3NpdGUt\ncGFja2FnZXMvZGVlcGNwZy9tb2RlbHMvY3BnLnB52gg8bGFtYmRhPrwAAADzAAAAAA==\n", null, [[-1, 1, 128]]], "function_type": "lambda", "module": "deepcpg.models.cpg", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "cpg_lambda_3", "inbound_nodes": [[["cpg_bidirectional", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dna_activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "dna_activation_2", "inbound_nodes": [[["dna_batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "cpg_bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 58}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 59}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 60}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}, "shared_object_id": 61}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "cpg_bidirectional_1", "inbound_nodes": [[["cpg_lambda_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dna_dropout", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}, "name": "dna_dropout", "inbound_nodes": [[["dna_activation_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "cpg_dropout_1", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}, "name": "cpg_dropout_1", "inbound_nodes": [[["cpg_bidirectional_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["dna_dropout", 0, 0, {}], ["cpg_dropout_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [1, -1]}, "name": "reshape", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "hybrid_attention", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 64, "value_dim": 64, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 1, 384], "key_shape": [null, 1, 384], "value_shape": [null, 1, 384]}, "name": "hybrid_attention", "inbound_nodes": [[["reshape", 0, 0, {"value": ["reshape", 0, 0], "key": ["reshape", 0, 0]}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["hybrid_attention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["flatten_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "joint_dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "joint_dense_2", "inbound_nodes": [[["layer_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "joint_batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "joint_batch_normalization_4", "inbound_nodes": [[["joint_dense_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "joint_activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "joint_activation_4", "inbound_nodes": [[["joint_batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "joint_dropout_2", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}, "name": "joint_dropout_2", "inbound_nodes": [[["joint_activation_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "joint_dense_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "joint_dense_3", "inbound_nodes": [[["joint_dropout_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "joint_batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "joint_batch_normalization_5", "inbound_nodes": [[["joint_dense_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "joint_activation_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "joint_activation_5", "inbound_nodes": [[["joint_batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "joint_dropout_3", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}, "name": "joint_dropout_3", "inbound_nodes": [[["joint_activation_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cpg/unified_sample_mean", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cpg/unified_sample_mean", "inbound_nodes": [[["joint_dropout_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cpg/unified_sample_logvar", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cpg/unified_sample_logvar", "inbound_nodes": [[["joint_dropout_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "cpg/unified_sample", "trainable": true, "dtype": "float32", "axis": -1}, "name": "cpg/unified_sample", "inbound_nodes": [[["cpg/unified_sample_mean", 0, 0, {}], ["cpg/unified_sample_logvar", 0, 0, {}]]]}], "input_layers": [["dna", 0, 0], ["cpg_state", 0, 0], ["cpg_dist", 0, 0]], "output_layers": [["cpg/unified_sample", 0, 0]]}, "keras_version": "2.11.0", "backend": "tensorflow"}